app/controllers/companies_controller.rb

SELECT "companies".* FROM "companies"
---
  def show
    @companies = Company.all

INSERT INTO "companies" ("name", "description", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "test"], ["description", "test"], ["email", "test"], ["created_at", 2016-12-18 01:35:40 UTC], ["updated_at", 2016-12-18 01:35:40 UTC]]
---
  def create
    Company.create(company_params)