app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees"
---
  def show
    @employees = Employee.all